{
	"name" : "Manas Ranjan Sahu",
	"title" : "Sr. Software Engineer",
	"contact" : "manas.sahu.one@gmail.com | 912-411-1150",
	"objective" : "To make high-quality, exciting, applications that people love to use on any device while working with other smart and highly motivated engineers.",
	"aboutme" : "",
	"social" : [
		{
			"link" : "https://www.github.com/manas-sahu",
			"name" : "GitHub"
		},
		{
			"link" : "https://www.linkedin.com/in/manas-sahu-1a5034106/",
			"name" : "LinkedIn"
		},
		{
			"link" : "#",
			"name" : "Google+"
		}
	],
	"skills" : [
		"JavaScript (ES 5/6)",
		"JavaScript Unit Testing",
		"HTML 4/5",
		"GRUNT",
		"RESTful web services",
		"CSS3",
		"GIT",
		"Media Query",
		"SVN",
		"JSON",
		"AJAX"
	],
	"frameworks" : [
		"Angular JS",
		"TypeScript",
		"Redmine",
		"ESlint",
		"JSInspect",
		"LESS",
		"jQuery",
		"Underscore.js",
		"Jasmine",
	        "KARMA",
		"LESS",
		"Nginx",
		"BOOTSTRAP",
		"Litmus",
		"Jenkins"
	],
	"projects" : [
		{
			"name" : "ARISTA",
			"technologies" : "Angular JS, HTML5, JavaScript, Less, ESlint, JSInspect, Jasmin",
			"description" : "Cloud Vision Portal (CVP) is web based application where in whole Network operations can be controlled through the web app by the admin. Devices, Switches, Routers are created virtually in the application and Configuration’s, IP’s are manually pushed to the respective switches orvices. This will enhance the usage of virtual devices over the web app to control the entire Network setup."
		},
		{
			"name" : "Sales Force",
			"technologies" : "HTML5, CSS3, jQuery, Media Query, Angular JS, Bootstrap",
			"description" : "All the projects are PSD to HTML conversion, where will get the PSD file from the client and we need covert them to HTML version from the scratch. Most of them are email newsletter & Single page Application. Also, we need to check for cross platform/domains rendering issues using litmus application. Business Unit: L’Oréal, Wyndham, Brooks Brothers, E-Trade, Burton, Ahold etc.."
		}
	],
	"experience" : [
		{
			"company" : "PAYODA",
			"title" : "Software Engineerr",
			"startDate" : "December 2015",
			"endDate" : "Present",	
			"responsibilities" : "- At PAYODA, I work on the ARISTA Team. I am responsible for adding new product features, bug fixes, and transitioning. 
									- Delivering a complete front-end application
									- Requirements Gathering and Sprint Planning.
									- Develop Single Page Application with responsibilities of automating Build process with Grunt and maintaining code quality.
									- Cooperating with the back-end developer in the process of building the RESTful API
									- Unit testing with Karma
									- Using SVN for versioning and revision control system"
			},
		{
			"company" : "THEOREM",
			"title" : "Web Developer",
			"startDate" : "Sptember 2013",
			"endDate" : "December 2015",
			"responsibilities" : "- At THEOREM, I work on the Sales Force Team. We are Responsible for working on a range of projects, designing appealing websites and interacting on a daily basis with graphic designers, back -end developers and marketers.
									- Developing and maintaining the front-end functionality of websites.
									- Scratch build, converting the mock-ups to web pages using HTML, CSS, jQuery, Media Query, Bootstrap.
									- Application built in using responsive design.
									- Testing the app with Litmus to make sure no rendering issues.
									- Direct interaction with client for requirements
									- Creating Landing Page/ Micro Pages using Angular JS.
									- Using Sales Force tool to maintain code."
		}
	],
	"education" : [
		{
			"school" : "Trident Academy Of Technology",
			"startDate" : "2010",
			"endDate" : "2013",
			"program" : "MCA",
			"achievements" : "8.79 CGPA"
		}
	]
}
