{
	"name" : "Manas Ranjan Sahu",
	"title" : "Sr. Software Engineer",
	"contact" : "manas.sahu.one@gmail.com | 912-411-1150",
	"objective" : "To make high-quality, exciting, applications that people love to use on any device while working with other smart and highly motivated engineers.",
	"aboutme" : "",
	"social" : [
		{
			"link" : "https://www.github.com/manas-sahu",
			"name" : "GitHub"
		},
		{
			"link" : "https://www.linkedin.com/in/manas-sahu-1a5034106/",
			"name" : "LinkedIn"
		},
		{
			"link" : "#",
			"name" : "Google+"
		}
	],
	"skills" : [
		"JavaScript (ECMAScript versions 1.5, ES6 and up)",
		"JavaScript Unit Testing",
		"HTML 4/5",
		"GRUNT",
		"RESTful web services",
		"CSS3",
		"GIT",
		"Media Query",
		"SVN",
		"JSON",
		"AJAX"
	],
	"frameworks" : [
		"Angular JS/2",
		"TypeScript",
		"Redmine",
		"ESlint",
		"JSInspect",
		"LESS",
		"jQuery",
		"Underscore.js",
		"Jasmine",
	        "KARMA",
		"LESS",
		"Nginx",
		"BOOTSTRAP",
		"Litmus",
		"Jenkins"
	],
	"projects" : [
		{
			"name" : "ARISTA",
			"technologies" : "Angular JS, HTML5, JavaScript, Less, ESlint, JSInspect, Jasmin",
			"description" : "Cloud Vision Portal (CVP) is web based application where in whole Network operations can be controlled through the web app by the admin. Devices, Switches, Routers are created virtually in the application and Configuration’s, IP’s are manually pushed to the respective switches orvices. This will enhance the usage of virtual devices over the web app to control the entire Network setup."
		},
		{
			"name" : "Sales Force",
			"technologies" : "HTML5, CSS3, jQuery, Media Query, Angular JS, Bootstrap",
			"description" : "All the projects are PSD to HTML conversion, where will get the PSD file from the client and we need covert them to HTML version from the scratch. Most of them are email newsletter & Single page Application. Also, we need to check for cross platform/domains rendering issues using litmus application. Business Unit: L’Oréal, Wyndham, Brooks Brothers, E-Trade, Burton, Ahold etc.."
		}
	],
	"experience" : [
		{
			"company" : "PAYODA",
			"title" : "Software Engineerr",
			"startDate" : "December 2015",
			"endDate" : "Present",	
			"responsibilities" : "At Netflix I work on the Acquisition Web Team.  We are responsible for adding new product features, bug fixes, and transitioning Account pages to the new Shakti platform. I also was one of the first engineers to introduce responsive pages to the account section of the website.",
			"achievements" : "Early adopter of the new Shakti platform, worked on the new Netflix logo and responsive header. Spoke at various conferences Netflix technologies at conferences.."
		},
		{
			"company" : "THEOREM",
			"title" : "Web Developer",
			"startDate" : "Sptember 2013",
			"endDate" : "December 2015",
			"responsibilities" : "Implement best practices to JavaScript codebase, develop new functionality and create new layouts, teach advanced JavaScript techniques to the team",
			"achievements" : "Introduced unit testing, continuous integration, source control, and development best practices to the team.  Started the Lunch and Learn program where team members teach each other new technologies and techniques. Lead development teams of up to 5 developers on profitable development projects."
		}
	],
	"education" : [
		{
			"school" : "Trident Academy Of Technology",
			"startDate" : "2010",
			"endDate" : "2013",
			"program" : "MCA",
			"achievements" : "8.79 CGPA"
		}
	]
}
